{
  "de": {
    "translation": {
      "pages": {
        "home": "RedVelvet",
        "write": {
          "title": "Schreiben",
          "pinned": "Angepinnt",
          "latest": "Neueste",
          "oldest": "Älteste"
        },
        "paper": {
          "lists": [
            {
              "title": "Kunst des Versteckens in kleinen Räumen: Tinyseed",
              "subtitle": "14. Dezember 2023",
              "url": "/write/tinyseed",
              "date": "Dez. 2023",
              "official_tinyseed_link": {
                "label": "tinyseed.io",
                "link": "https://tinyseed.io"
              },
              "warning": "Es gibt absolut keine Daten, die diese Website verlassen. Alles befindet sich auf Ihrem Computer, alle darauf befindlichen Daten werden nach der Verarbeitung sofort gelöscht.",
              "read_more": "Mehr lesen",
              "close": "Schließen",
              "pre_content": "Digitale Umsetzung von ",
              "content": ", Mit Tinyseed können Sie die Seed-Phrase oder Shamirs geheime Anteile Ihrer Wallet sichern. Damit können Sie Bitcoin, Ethereum und NFT vor Verlust schützen.",
              "sub_content": "Sie können diese Seite ausdrucken (Strg+P oder ⌘ Befehl+P) und sicher aufbewahren.",
              "choose_proposal": "Wählen Sie einen der Vorschläge:",
              "use": "Verwenden",
              "words": "Wörter",
              "indexes": "Indizes",
              "instead": "Sie stattdessen"
            },
            {
              "title": "Auf der Suche nach Freiheit jenseits des Kaninchenbaus: These I",
              "subtitle": "15. September 2023",
              "url": "/write/thesis",
              "date": "Sep 2023",
              "warning": "In der Planungsphase"
            },
            {
              "title": "Eintauchen in den Kaninchenbau: Perspektive der Informatik",
              "subtitle": "12. September 2023",
              "url": "/write/perspective-of-computer-science",
              "date": "Sep 2023",
              "warning": "Achtung: Diese Notizen enthalten Meinungen, persönliche Erfahrungen und extreme Standpunkte zur Informatik im Vorlesungskontext. Es ist nicht dazu gedacht, eine Partei zu erniedrigen oder zu beleidigen; bitte verdauen Sie es nicht ohne weitere Überlegung. Wenn Sie auf „Weiterlesen“ klicken, erklären Sie sich damit einverstanden.",
              "read_more": "Mehr lesen",
              "close": "Schließen",
              "content": "Haben Sie jemals das Gefühl gehabt, dass gute Noten oder Notendurchschnitte in der Welt der Bildung nicht alles sind? Diese Notiz enthält meine Ansichten, die sehr unterschiedlich sein können, vielleicht werden sogar Sie sie bestreiten. Ich verlange nichts anderes, um Sie zu zwingen, meiner Meinung oder meinen Ansichten zuzustimmen; mein Grundsatz besteht darin, dem Selbstverständnis und der Weiterentwicklung Vorrang einzuräumen, anstatt nur nach guten Noten oder GPA zu streben. Mein Bildungshintergrund ist ein Abiturient mit Schwerpunkt Naturwissenschaften.\n\nBeginnen wir mit etwas Interessantem. Am Ende des Semesters stellte mein Professor mit Nachdruck fest: „Man muss kein Informatikstudent sein, um Programmierer oder Softwareentwickler zu werden.“ Ich stimmte seinen Ansichten voll und ganz zu, während die meisten anderen Studenten schockiert waren, als sie das hörten. Wie würden Sie sich fühlen, wenn Sie inmitten der Verwirrung und Erschöpfung des Colleges gegen Ende des Semesters eine solche Aussage hören würden? Werden Sie es bereuen, sich für das Hauptfach Informatik entschieden zu haben? Haha, es tut mir persönlich nicht leid. Ich stimme dem Dozenten zu, denn als ich seine Argumentation hörte, habe ich es bewiesen, indem ich mit nur einem Softwareprojekt, das nur die Programmiersprache JavaScript verwendet, rund 60 Millionen IDR oder rund 3.900 US-Dollar verdient habe (das Projekt läuft noch heute und ist produktiv). ). Zur weiteren Information: Auf meinem Campus wird JavaScript überhaupt nicht unterrichtet.\n\nVielleicht verstehen Sie jetzt, warum ich Notendurchschnitte nicht wirklich priorisiere. Für mich sind Noten nur Gekritzel auf dem Papier und bloße Anerkennung, die meinen Zielen im Wege steht. Ich glaube nicht, dass gute Noten gleichbedeutend mit großen Fähigkeiten sind. Ich glaube, dass Wert durch echtes Handeln und Verantwortung bewiesen werden sollte.\n\nVielleicht fragen Sie sich, wie ich durch Informatik produktiv sein kann, obwohl ich keinen guten akademischen Ruf habe? Bevor ich antworte, bedenken Sie Ihre Ziele beim Hochschulzugang. Stimmt es, dass man nur für Geld und Geld zur Universität geht? Glauben Sie, dass ein Studium der einzige Weg zu einem guten Job ist? Meine Antwort ist, den Wert zu ignorieren und mich zuerst auf den finanziellen Aspekt zu konzentrieren. Das bedeutet nicht, dass ich keine Noten brauche; Ich habe es einfach beiseite gelegt.\n\nIch habe diese Entscheidung nicht leichtfertig getroffen. Ich habe einen bestimmten Grund, warum ich nicht an Noten glaube. Man könnte mich als verrückt oder dumm bezeichnen, und ich werde nicht widersprechen, wenn man bedenkt, dass mein Notendurchschnitt unter dem Durchschnitt liegt. Ich mache mir Sorgen, weil viele gute Noten haben, aber in der realen Welt Schwierigkeiten haben. Auch wenn mich das eigentlich nichts angeht, mache ich mir Sorgen, denn gute Noten bedeuten nicht immer, dass man über praktische Fähigkeiten verfügt.\n\nMöchten Sie noch einmal etwas Überraschendes hören? Mein Professor sagte, dass „90 % der Studenten, die Seminare belegen, völlig durcheinander sind“ und sie trotzdem bestehen. Ich erhielt auch mehrere Angebote, meinen Mitschülern, die bessere Noten hatten als ich, bei der Anfertigung ihrer Abschlussarbeiten zu helfen; Nur einige Angebote nehme ich an, weil sie eher Geld als Wert oder bloße Anerkennung bieten.\n\nWenn ja, aus welcher Perspektive sollte ich an Wert glauben?",
              "resolution": "Lösung: Dinge, die Sie beachten sollten, wenn Sie sich autodidaktisch oder im Bachelor-Studium der Informatik mit der Informatik befassen möchten.",
              "resolution_content": "Machen Sie sich keine Sorgen, auch wenn Sie keinen Abschluss an einer Berufsfachschule oder einem naturwissenschaftlichen Hauptfach haben. Ich bin mir sicher, dass Sie allein durch die Nutzung des Internets (selbststudium oder ohne den Besuch von Vorlesungen) zum Profi auf dem Gebiet der Informatik werden können. Außerdem war ich völlig blind, als ich zum ersten Mal in die Welt der Informatik einstieg, und eine meiner Ängste galt der Mathematik, selbst JavaScript ist da keine Ausnahme.\n\nGehen Sie nicht davon aus, dass das College der einzige Weg ist, einen Job zu bekommen. Es gibt viele Menschen, die keinen akademischen Abschluss haben, aber ihren Kindern eine gute Ausbildung ermöglichen können. Womit finanzieren sie Ihrer Meinung nach die Ausbildung ihrer Kinder? Blatt? Studieren Sie, um sich zu verbessern und einen guten Ruf aufzubauen. Mit einem Abschluss kann Ihre berufliche Position steigen und Sie können ein höheres Gehalt verdienen. Denken Sie jedoch daran, dass Sie auch für den Namen und Titel verantwortlich sein müssen, den Sie erhalten.\n\nMit einem unabhängigen (autodidaktischen) Lernansatz können Sie wirklich ein Experte werden. Wenn Sie sich für diesen Weg entscheiden, ist das College eine Notwendigkeit (zusätzlich), während sich das College bei einer anderen Route möglicherweise stärker auf die Notwendigkeit (Hauptstudium) konzentriert. Neben Fachwissen ist auch ein breites Netzwerk bzw. gute Kontakte sehr wichtig, wenn man den autodidaktischen Weg einschlägt. Tatsächlich müssen Sie am Ende Ihres Studiums Ihre Fähigkeiten zum selbstständigen Lernen erheblich weiterentwickeln, allerdings unter Anleitung und Anleitung durch Dozenten.\n\nNach Ihrem Eintritt in die Universität folgen Sie einem vorgegebenen Lehrplan. Sie werden auf eine Vielzahl von Themen stoßen, von denen einige meiner Meinung nach je nach Ihren Ambitionen als optional angesehen werden können. Die Themen, mit denen Sie konfrontiert werden, decken verschiedene Bereiche ab, von Programmieralgorithmen, Softwareentwicklung, Analysis, künstlicher Intelligenz, Design bis hin zu Softwaretests.\n\nWarum ist es optional? Meiner Meinung nach ist der Versuch, alle Fächer zu beherrschen, vielleicht zu viel, aber es schadet nicht, es schaffen zu können. Mein Rat ist, dass Sie sich besser auf das Erreichen Ihrer Ziele konzentrieren sollten, anstatt sich anzustrengen, die höchste Punktzahl in allen Fächern zu erreichen, die am Ende vergessen werden (Weil sie in der Arbeitswelt nutzlos sind). Achten Sie auf ausreichende Noten für irrelevante Fächer und maximieren Sie den Unterricht, der für Ihre zukünftigen Karriereziele relevant ist.\n\nBeachten Sie, dass jeder Dozent auch über sein eigenes Fachgebiet verfügt. Ich bin mir sicher, dass man an der Hochschule keine Mathematikdozenten sieht, die den Zusammenhang zwischen Mathematik und Informatik (Programmen) direkt umsetzen und erklären. Abgesehen davon ist es selten, dass Dozenten, die Programmieren unterrichten, mathematische Kenntnisse früherer Dozenten direkt in das von ihnen unterrichtete Programm anwenden. All dies liegt in Ihrer Verantwortung für die Selbstentwicklung und hängt mit der Erreichung Ihrer Ziele zusammen. Wird Ihre zukünftige Arbeit ein Verständnis komplexer Mathematik erfordern? Wenn nicht, müssen Sie es nicht übertreiben, um Ihr Mathematikverständnis zu maximieren.\n\nWarum sollten Sie sich anstrengen, alle Fächer zu beherrschen? Willst du ein Avatar sein? Ich halte das für Zeitverschwendung. Denken Sie daran, dass es für einen Boxer nicht erforderlich ist, wie ein Pilot fliegen zu können, und umgekehrt.\n\nIch meine also nicht, dass das College und bestimmte Fächer nicht wichtig sind. Vielleicht spüren Sie es später selbst, wenn Sie ans College kommen. Auch wenn es als „Hauptfach“ bezeichnet wird, ist es meines Erachtens überhaupt nicht fokussiert oder spezifisch, sondern eher breit und umfassend. Dort sind viele Fächer optional (jedes Fach kann zu unterschiedlichen Berufen führen), es wird jedoch erwartet, dass Sie insgesamt gute Noten bekommen. Dies kann ein Hindernis sein, wenn Sie eine bestimmte Leidenschaft oder ein bestimmtes Ziel gefunden haben. Ist es möglich, alle Berufe zu meistern?\n\nDiese Notizen helfen Ihnen, Vorbereitungen entsprechend Ihrer Leistungen im Voraus zu planen, sodass keine Zeit- und Energieverschwendung entsteht. Ja, ich verstehe voll und ganz, dass in der Wissenschaft nichts verschwendet wird, wenn wir sie aufrichtig studieren.\n\nLetztendlich hat alles, egal ob Noten (GPA) oder College, Wert und Relevanz, wenn es den Bedürfnissen und Zielen jedes Einzelnen entspricht. Wenn Sie dazu in der Lage sind, schadet es nicht, aufs College zu gehen und trotzdem auf die Noten zu achten, aber wenn Sie meiner Meinung zustimmen, versuchen Sie, in Fächern, die für Ihre Ziele nicht relevant sind, angemessene Noten zu bekommen (vermeiden Sie Wiederholungen). Konzentrieren Sie sich mehr auf die Entwicklung Ihrer Fähigkeiten und das Erreichen Ihrer Karriereziele in der Zukunft und versuchen Sie, in Fächern, die für Ihren Beruf relevant sind, gute Noten zu erreichen.\n\nIm schlimmsten Fall, wenn Sie etwas Ähnliches wie ich erleben und sogar zu spät Ihren Abschluss machen, dann nicht Nicht traurig. Wenn Sie endlich Ihren Abschluss machen, werden Ihre Berufserfahrung und Flugstunden ausreichen, um einen guten Job zu finden. Worüber müssen Sie sich Sorgen machen, insbesondere wenn Sie bereits während Ihres Informatikstudiums ein geregeltes Einkommen erzielen konnten? Akademische Noten? Haha.\n\nSuchen Sie nicht nur nach Noten mit dem Ziel, Ihren Abschluss zu machen, sondern suchen Sie nach Noten, für die Sie verantwortlich sein können. Lassen Sie sich nach dem Abschluss nicht in einem Bereich arbeiten, der nicht mit dem übereinstimmt, was Sie während Ihres Studiums gelernt haben; es ist eine Verschwendung von Geld, Zeit und Energie."
            },
            {
              "title": "Blühende rote Rosen: Eine Einführung",
              "subtitle": "24. Februar 2023\nLetzte Aktualisierung am 12. Dezember 2023",
              "url": "/write/an-introduction",
              "date": "Feb 2023",
              "github_link": "https://github.com/monikaquentin",
              "gitlab_link": "https://gitlab.com/monikaquentin",
              "linkedin_link": "https://linkedin.com/in/rasetiansyah",
              "about_me": "Über mich?",
              "about_me_content": "Ich schreibe Software, JavaScript ist die Hauptsprache.",
              "about_site": "Über diese Site?",
              "about_site_content": "Dies ist eine persönliche Website, die ich in meiner Freizeit entwickelt habe. Die Entwicklung begann im Februar/März 2023, als ich eine Plattform haben wollte, auf der ich meine schriftlichen Arbeiten und einige von mir erstellte Software hosten konnte. ReactJS verwenden und es so einfach wie möglich gestalten, inspiriert von der Standard-NGINX-Seite. Derzeit (letzte Veröffentlichung) verfügt diese Website überhaupt über kein Back-End und ist Open Source.\n\nIch stelle sicher, dass die gesamte Software auf dieser Website transparent und sicher für die öffentliche Nutzung ist.",
              "about_darknet": "Versteckter Dienst (TOR)",
              "about_darknet_content": "Diese Seite ist auch im Darknet online, Sie können sie mit aktiviertem JavaScript aufrufen ",
              "about_darknet_link": {
                "label": "Hier",
                "link": "http://unicorn465jakmpxhawaumyujt52wess5qhal6ng3dcm32uprpzy33qd.onion"
              }
            }
          ]
        },
        "curve25519": {
          "single": {
            "description": "Einzelner Schlüsselaustausch mit elliptischer Kurve mit Diffie-Hellman- und AES-256-GCM-Algorithmus (Galois/Counter-Modus). Es gibt absolut keine Daten, die diese Website verlassen. Alles befindet sich auf Ihrem Computer, alle darauf befindlichen Daten werden nach der Verarbeitung sofort gelöscht.",
            "info": "Von RedVelvet ausgegebene, für Menschen unlesbare Nachrichten sind immer Hexdump.",
            "subtitle": "Ende-zu-Ende-Verschlüsselung | Einzel"
          },
          "multiple": {
            "description": "Schlüsselaustausch mehrerer elliptischer Kurven mit Diffie-Hellman- und AES-256-GCM-Algorithmus (Galois/Counter-Modus). Es gibt absolut keine Daten, die diese Website verlassen. Alles befindet sich auf Ihrem Computer, alle darauf befindlichen Daten werden nach der Verarbeitung sofort gelöscht.",
            "info": "Von RedVelvet ausgegebene, für Menschen unlesbare Nachrichten sind immer Hexdump.",
            "subtitle": "Ende-zu-Ende-Verschlüsselung | Mehrere"
          },
          "decrypt": {
            "description": "Für die Entschlüsselung sind lediglich der Shared Key und Hexdump (verschlüsselte Nachricht) erforderlich. Es gibt absolut keine Daten, die diese Website verlassen. Alles befindet sich auf Ihrem Computer, alle darauf befindlichen Daten werden nach der Verarbeitung sofort gelöscht.",
            "info": "Von RedVelvet ausgegebene, für Menschen unlesbare Nachrichten sind immer Hexdump.",
            "subtitle": "Ende-zu-Ende-Verschlüsselung | Entschlüsseln"
          },
          "error_messages": {
            "bad_key_exchange": "Fehlerhafter Schlüsselaustausch.",
            "hex_key_format": "Muss aus 64 Hexadezimalzeichen bestehen / entsprechend 32 Bytes / 256 Bit.",
            "key_x1_duplicated": "Schlüssel X1 ist ungültig oder dupliziert.",
            "key_x": "Schlüssel X",
            "is_invalid": " ist ungültig.",
            "is_invalid_duplicated": " ist ungültig oder dupliziert.",
            "minimum_key": "Es werden mindestens 2 Schlüssel benötigt."
          },
          "other": {
            "private_key": "Privat Schlüssel",
            "supports": "Unterstützt",
            "copy": "Kopieren",
            "copy_success": "Erfolgreich in die Zwischenablage kopiert.",
            "link": {
              "to_single": "einzelner privater Schlüssel",
              "to_multiple": "mehrere private Schlüssel",
              "button": {
                "p": "Auf der Suche nach einem Weg dazu",
                "encrypt": "Verschlüsseln",
                "decrypt": "entschlüsseln"
              }
            },
            "button": {
              "derive": "Ableiten",
              "add_privkey": "Privaten Schlüssel hinzufügen",
              "lock": "Sperren",
              "lock_and_derive": "Sperren und ableiten",
              "unlock": "Freischalten"
            },
            "label": {
              "private_key_input": "Ihr privater Schlüssel",
              "public_key_input": "Ihr öffentlicher Schlüssel",
              "x1_private_key": "X1 Privat Schlüssel",
              "x1_public_key": "X1 Öffentlicher Schlüssel",
              "shared_key_input": "Gemeinsamer Schlüssel",
              "plaintext_message_text_area": "Nachricht",
              "ciphertext_message_text_area": "Hex(dump)",
              "disrupted_message": "Gestörte Nachricht",
              "decrypted_message": "Entschlüsselte Nachricht"
            },
            "placeholder": {
              "hex_placeholder": "Hexadezimalzahl-64-Zeichen/32-Byte/256-Bit",
              "plaintext_message_text_area": "Verschlüsselte Nachrichten werden empfohlen '-----BEGIN PGP MESSAGE-----'"
            },
            "description": {
              "plaintext_message_text_area": "Geben oder fügen Sie Ihre Nachricht ein.",
              "ciphertext_message_text_area": "Fügen Sie Ihre verschlüsselte Nachricht ein."
            }
          }
        },
        "bmac": {
          "title": "Kauf mir einen Kaffee",
          "last_update": "Zuletzt aktualisiert am 27. November 2023",
          "greeting": "\n\nIch wünsche ihnen einen wunderbaren Tag!",
          "currency": {
            "btc": "Bitcoin (Taproot-Bech32)",
            "xmr": "Monero (XMR)",
            "sc": "Ethereum oder Smart Chain (ERC20/BEP20)",
            "trx": "Tron (TRC20)"
          }
        },
        "notfound": {
          "title": "Nicht gefunden",
          "links": {
            "l1": "Geh zurück",
            "l2": "Kontaktieren Sie Support"
          }
        }
      },
      "maintenance": {
        "p1": "Wenn Sie diese Seite sehen, funktioniert Cloudfront ordnungsgemäß und es wird etwas eingerichtet. Es ist weitere Wartezeit erforderlich.\n\nInformationen und geschäftliche Anfragen finden Sie unter",
        "p2": "\n\nIch wünsche ihnen einen wunderbaren Tag!"
      }
    }
  }
}
