{
  "de": {
    "translation": {
      "pages": {
        "write": "Schreiben",
        "home": "RedVelvet"
      },
      "paper_list": [
        {
          "title": "Eintauchen in das Kaninchenloch: Perspektive der Informatik",
          "url": "/write/perspective-of-computer-science",
          "date": "Sep 2023",
          "full_date": "12. September 2023",
          "warning": "Warnung: Dieser Hinweis enthält Meinungen, persönliche Erfahrungen und extreme Perspektiven zur Informatik im Kontext der Hochschulbildung. Er soll niemanden herabsetzen oder beleidigen; bitte nehmen Sie ihn nicht ohne weitere Überlegung als bare Münze. Durch Klicken auf \"Mehr lesen\" wird davon ausgegangen, dass Sie dies verstehen.",
          "read_more": "Mehr lesen",
          "close": "Schließen",
          "content": "Haben Sie jemals das Gefühl gehabt, dass hohe Noten oder GPAs nicht alles in der Welt der Bildung sind? Dieser Hinweis enthält meine Ansichten, die sehr unterschiedlich sein können, und Sie könnten sogar anderer Meinung sein. Ich bitte Sie nicht, meine Meinungen zu teilen oder zu akzeptieren; mein Grundsatz ist es, das Verständnis und die Selbstentwicklung über das bloße Verfolgen hoher Noten oder GPAs zu stellen. Mein Bildungshintergrund ist ein Abschluss in Naturwissenschaften von der High School.\n\nLassen Sie uns mit etwas Interessantem beginnen. Am Ende des Semesters erklärte mein Professor nachdrücklich: \"Sie müssen kein Informatikstudent sein, um ein Programmierer oder Softwareentwickler zu sein.\" Ich stimme seiner Ansicht voll und ganz zu, während die meisten anderen Studenten schockiert waren, dies zu hören. Wie würden Sie sich fühlen, wenn Sie mitten in Ihrer Studienzeit eine solche Aussage gegen Ende des Semesters hören würden, während Sie verwirrt und erschöpft sind? Würden Sie es bereuen, Informatik als Ihr Hauptfach gewählt zu haben? Haha, persönlich bereue ich es nicht. Ich stimme mit dem Professor überein, weil ich bereits bewiesen hatte, indem ich ungefähr sechzig Millionen IDR oder etwa 3.900 USD aus nur einem Softwareprojekt mit der Programmiersprache JavaScript verdiente (das Projekt läuft noch und ist bis heute produktiv). Zu Ihrer Information, meine Universität lehrt JavaScript überhaupt nicht.\n\nVielleicht verstehen Sie jetzt, warum ich GPAs nicht zu sehr priorisiere. Für mich sind Noten nur Krakeleien auf Papier und eine bloße Anerkennung, die meine Ziele behindert. Ich glaube nicht, dass hohe Noten zwangsläufig großartige Fähigkeiten bedeuten. Ich glaube, Noten sollten durch echte Handlungen und übernommene Verantwortlichkeiten bewiesen werden.\n\nSie könnten sich fragen, wie ich in der Informatik produktiv sein kann, wenn mein akademischer Ruf nicht gerade glänzend ist? Bevor ich das beantworte, überlegen Sie sich Ihre Ziele beim Eintritt an die Universität. Sind Sie wirklich nur wegen des Geldes und wegen des Geldes an die Universität gegangen? Denken Sie, dass ein Abschluss der einzige Weg zu einem guten Job ist? Meine Antwort ist, zuerst die Noten zu vernachlässigen und sich auf finanzielle Aspekte zu konzentrieren. Das bedeutet nicht, dass ich keine Noten brauche; ich lege sie nur beiseite.\n\nIch habe diese Entscheidung nicht leichtfertig getroffen. Ich habe konkrete Gründe, warum ich Noten nicht vertraue. Sie könnten mich verrückt oder töricht nennen, und ich werde nicht dagegen argumentieren, wenn man bedenkt, dass mein Notendurchschnitt unter dem Durchschnitt liegt. Ich mache mir Sorgen, weil viele hohe Noten haben, aber in der realen Welt kämpfen. Obwohl das nicht mein Problem ist, mache ich mir Sorgen, weil hohe Noten nicht immer praktische Fähigkeiten bedeuten.\n\nWollen Sie noch etwas Überraschendes hören? Mein Professor sagte: \"90% der Studenten, die Seminare besuchen, sind alle durcheinander\", und sie bestehen trotzdem. Ich habe auch mehrere Angebote erhalten, Kommilitonen mit besseren Noten als ich bei der Fertigstellung ihrer Abschlussarbeiten zu helfen; nur wenige Angebote habe ich angenommen, weil sie Geld angeboten haben, nicht nur Noten oder Anerkennung.\n\nWenn dem so ist, aus welcher Perspektive sollte ich Noten vertrauen?",
          "resolution": "Auflösung: Dinge, die Sie beachten sollten, wenn Sie sich autodidaktisch oder auf Hochschulniveau mit Informatik beschäftigen möchten.",
          "resolution_content": "Keine Sorge, auch wenn Sie kein Absolvent einer Berufsschule oder eines Naturwissenschafts (Naturwissenschaften) Studiengangs sind. Ich glaube, Sie können ein Profi auf dem Gebiet der Informatik werden, indem Sie einfach das Internet nutzen (Selbststudium oder ohne Vorlesungen zu besuchen). Ich war völlig ahnungslos, als ich mich zum ersten Mal in die Welt der Informatik wagte, und eine meiner Ängste war die Mathematik, selbst JavaScript war keine Ausnahme.\n\nGlauben Sie nicht, dass das College der einzige Weg ist, um einen Job zu bekommen. Draußen gibt es viele Menschen ohne akademische Grade, die ihren Kindern dennoch eine gute Bildung bieten können. Wovon glauben Sie finanzieren sie die Ausbildung ihrer Kinder? Blätter? Gehen Sie aufs College, um sich selbst zu verbessern und einen guten Ruf aufzubauen. Mit einem Abschluss kann Ihre berufliche Position steigen, und Sie können ein höheres Gehalt verdienen. Denken Sie jedoch daran, dass Sie auch für den Namen und den Grad, den Sie erhalten, verantwortlich sein müssen.\n\nSie können wirklich ein Experte mit einem selbstständigen Lernansatz (autodidaktisch) werden. Wenn Sie diesen Weg wählen, wird das College eine Anforderung (zusätzlich), während das College auf einem anderen Weg möglicherweise stärker auf Bedürfnisse (primär) ausgerichtet ist. Neben der Expertise ist auch ein breites Netzwerk oder breite Verbindungen von entscheidender Bedeutung, wenn Sie den autodidaktischen Weg einschlagen. Tatsächlich werden Sie am Ende, wenn Sie an der Universität sind, weiterhin erhebliche Anstrengungen unternehmen müssen, um Ihre Fähigkeiten im autodidaktischen Lernen zu entwickeln, jedoch unter Anleitung und Anleitung von Dozenten.\n\nNachdem Sie die Universität betreten haben, werden Sie dem festgelegten Lehrplan folgen. Sie werden verschiedenen Fächern gegenüberstehen, von denen einige in meiner Sichtweise als optional angesehen werden können, abhängig von Ihren Ambitionen. Die Fächer, mit denen Sie konfrontiert werden, umfassen verschiedene Bereiche, von Programmieralgorithmen, Softwaretechnik, Kalkül, künstliche Intelligenz, Design bis hin zur Softwareprüfung.\n\nWarum optional? In meiner Sichtweise ist es möglicherweise zu übertrieben, sich darum zu bemühen, alle Fächer zu beherrschen, aber es ist nicht falsch, wenn Sie es können. Mein Rat ist es, anstelle sich sehr um die höchsten Noten in allen Fächern zu bemühen, die schließlich vergessen werden (weil sie in der realen Welt nicht verwendet werden), sich besser auf das Erreichen Ihrer Ziele zu konzentrieren. Suchen Sie ausreichende Noten für irrelevante Fächer und maximieren Sie das Lernen in Fächern, die für Ihre zukünftigen Berufsziele relevant sind.\n\nBeachten Sie, dass jeder Dozent auch sein eigenes Fachgebiet hat. Ich bin sicher, dass Sie, wenn Sie zum College gehen, keinen Mathematikdozenten direkt sehen werden, der sein mathematisches Wissen in die Informatik (Programmierung) implementiert und seine Relevanz erklärt. Darüber hinaus ist es selten, dass Programmierdozenten das mathematische Wissen der vorherigen Dozenten direkt in das Programm übernehmen, das sie Ihnen beibringen. Das alles liegt in Ihrer Verantwortung zur Selbstentwicklung, und es kommt alles darauf an, Ihre Ziele zu erreichen. Wird Ihr zukünftiger Beruf eine tiefe Kenntnis komplexer Mathematik erfordern? Wenn nicht, müssen Sie nicht übertreiben, um Ihr Verständnis der Mathematik zu maximieren.\n\nWarum sollten Sie sich sehr bemühen, alle Fächer zu beherrschen? Wollen Sie zu einem Avatar werden? Ich halte es für Zeitverschwendung. Denken Sie daran, ein Boxer ist nicht verpflichtet, wie ein Pilot zu fliegen, und umgekehrt.\n\nAlso, mein Punkt ist nicht, das College und bestimmte Fächer als unwichtig zu betrachten. Sie könnten es selbst erleben, wenn Sie später das College betreten. Obwohl es in meiner Sichtweise als \"Hauptfach\" bezeichnet wird, ist es meiner Ansicht nach überhaupt nicht fokussiert oder spezifisch, sondern eher breit gefächert und umfangreich. Dort sind viele Fächer optional (jedes Fach kann zu verschiedenen Berufen führen), aber es wird erwartet, dass Sie insgesamt gute Noten erhalten. Dies kann ein Hindernis sein, wenn Sie bereits eine bestimmte Leidenschaft oder ein bestimmtes Ziel gefunden haben. Ist es möglich, alle Berufe zu beherrschen?\n\nAlles hat Wert und Relevanz, wenn es den Bedürfnissen und Zielen jedes Einzelnen entspricht. Dieser Hinweis hilft Ihnen, angemessene Vorbereitungen für Ihre frühen Erfolge zu planen, damit keine Zeit und Energie verschwendet wird. Ja, ich verstehe vollkommen, dass in der Wissenschaft nichts verschwendet wird, wenn wir sie aufrichtig studieren.\n\nAm Ende haben sowohl Noten (GPA) als auch das College ihre Bedeutung. Wenn Sie können, gibt es nichts Falsches daran, ins College zu gehen und trotzdem auf Noten zu achten, aber wenn Sie meiner Meinung zustimmen, versuchen Sie ausreichende Noten in Fächern zu bekommen, die irrelevant für Ihre Berufsziele sind (vermeiden Sie Wiederholungen). Konzentrieren Sie sich stärker auf die Entwicklung von Fähigkeiten und das Erreichen Ihrer zukünftigen Berufsziele und streben Sie hohe Noten in Fächern an, die für Ihren Beruf relevant sind.\n\nIm schlimmsten Fall, wenn Sie etwas Ähnliches wie ich erleben und sogar spät abschließen, seien Sie nicht traurig. Wenn Sie schließlich abschließen, sind Ihre Berufserfahrung und Flugstunden ausreichend, um einen guten Job zu finden. Besonders wenn Sie bereits während Ihrer College-Jahre ein stabiles Einkommen aus den Ergebnissen der Informatik selbst erzielen konnten, wofür müssen Sie sich Sorgen machen? Akademische Noten? Haha.\n\nStreben Sie nicht nur nach Noten, um zu bestehen, sondern streben Sie nach Noten, die Sie rechtfertigen können. Lassen Sie nach dem Studium nicht zu, dass Sie in einem Bereich arbeiten, der nicht zu dem passt, was Sie während Ihrer College-Jahre gelernt haben; es ist eine Verschwendung von Geld, Zeit und Energie."
        },
        {
          "title": "Blühende rote Rosen: Einführung",
          "url": "/write/introduction",
          "date": "Aug 2022",
          "full_date": "7. August 2023",
          "warning": null,
          "read_more": null,
          "close": null,
          "content": "JavaScript-Entwickler",
          "resolution": null,
          "resolution_content": null
        }
      ],
      "maintenance": {
        "p1": "Wenn Sie diese Seite sehen, funktioniert Cloudfront ordnungsgemäß, und es wird etwas eingerichtet. Weitere Wartezeit ist erforderlich.\n\nFür Informationen und geschäftliche Anfragen verweisen Sie bitte auf",
        "p2": "\n\nHaben Sie einen schönen Tag!"
      }
    }
  }
}
