{
  "en": {
    "translation": {
      "pages": {
        "write": "Writing",
        "home": "RedVelvet"
      },
      "paper_list": [
        {
          "title": "Diving into the Rabbit Hole: Perspective of Computer Science",
          "url": "/write/perspective-of-computer-science",
          "date": "Sep 2023",
          "full_date": "September 12, 2023",
          "warning": "Warning: This note contains opinions, personal experiences, and extreme perspectives on computer science in the context of academia. It is not intended to belittle or offend anyone; please do not take it at face value without further consideration. By clicking \"Read More\" you are assumed to understand.",
          "read_more": "Read More",
          "close": "Close",
          "content": "Have you ever felt that high grades or GPAs are not everything in the world of education? This note contains my views, which may be very different, and you may even disagree with them. I'm not asking or forcing you to agree with my opinions; my principle is to prioritize understanding and self-development over merely chasing high grades or GPAs. My educational background is a graduate of natural science from high school.\n\nLet's start with something interesting. At the end of the semester, my professor firmly stated, \"You don't need to be an Informatics student to be a programmer or software developer.\" I fully agree with his view, while most other students were shocked to hear it. How would you feel if, amid confusion and exhaustion during your studies, you heard such a statement towards the end of the semester? Would you regret choosing Informatics as your major? Haha, personally, I do not regret it. I align with the professor because when I heard his argument, I had already proven it by making approximately sixty million IDR or about $3,900 from just one software project using the JavaScript programming language (the project is still ongoing and productive to this day). For additional information, my campus does not teach JavaScript at all.\n\nNow maybe you understand why I don't prioritize GPAs too much. For me, grades are just scribbles on paper and mere recognition that hinders my goals. I don't believe that having high grades necessarily means having great skills. I believe grades should be proven through real actions and responsibilities undertaken.\n\nYou might wonder how I can be productive in Computer Science with a less-than-stellar academic reputation? Before I answer that, consider your goals when entering university. Did you really enter university only for money and because of money? Do you think a degree is the only path to a good job? My answer is choosing to disregard grades and focus on financial aspects first. It doesn't mean I don't need grades; I just set them aside.\n\nI didn't make this decision lightly. I have specific reasons why I don't trust grades. You might call me crazy or foolish, and I won't argue with that, considering my GPA is below average. I'm worried because many have high grades but struggle in the real world. Although this is not my business, I worry because high grades don't always mean practical skills.\n\nWant to hear something surprising again? My professor said that \"90% of students who attend seminars are all messed up\" and they still pass. I also received several offers to help fellow students with higher grades than mine in completing their theses; only a few offers I accepted because they offered money, not just grades or recognition.\n\nIf so, from which perspective should I trust grades?",
          "resolution": "Resolution: Things to consider if you want to delve into Computer Science on a self-taught or undergraduate level in Informatics.",
          "resolution_content": "Don't worry, even if you're not a graduate of vocational school or a natural science (science) major. I believe you can become a professional in the field of computer science just by using the internet (self-learning or without attending lectures). I was completely clueless when I first ventured into the world of computer science, and one of my fears was mathematics, even JavaScript was no exception.\n\nDon't assume that college is the only way to get a job. Out there, many people do not have academic degrees but can provide a good education to their children. What do you think they finance their children's education with? Leaves? Go to college to improve yourself and build a reputation. With a degree, your job position can rise, and you can earn a higher salary. However, remember that you also have to be responsible for the name and degree you obtain.\n\nYou can truly become an expert with a self-learning approach (self-taught). If you choose this path, college will be a requirement (additional), while if you choose another path, college may be more focused on needs (primary). In addition to expertise, having a wide network or connections is also very important if you take the self-taught path. Actually, in the end, when you are in college, you will still be required to develop self-learning skills significantly, but with guidance and direction from lecturers.\n\nOnce you enter university, you will follow the established curriculum. You will face various subjects, some of which may be considered optional in my view, depending on your aspirations. Subjects you will encounter cover various fields, ranging from Programming Algorithms, Software Engineering, Calculus, Artificial Intelligence, Design, to Software Testing.\n\nWhy optional? In my view, striving to master all subjects may be too excessive, but it's not wrong if you can do it. My advice is, rather than striving hard to achieve the highest grades in all subjects that will eventually be forgotten (because they are not used in the real world), it's better to focus on achieving your goals. Seek sufficient grades for irrelevant subjects and maximize learning in subjects relevant to your future career goals.\n\nNote that each lecturer also has their own field of expertise. I'm sure that when you attend college, you won't see a mathematics lecturer directly implementing and explaining the relevance of his mathematics knowledge to computer science (programming). Furthermore, it is rare for programming lecturers to apply mathematical knowledge from previous lecturers directly into the program they teach you. All of this is your responsibility in self-development, and it all comes back to achieving your goals. Will your future job require a deep understanding of complex mathematics? If it doesn't, there's no need to overdo it in maximizing your understanding of mathematics.\n\nWhy should you strive hard to master all subjects? Do you want to become an avatar? I consider it a waste of time. Remember, a boxer is not required to fly like a pilot, and vice versa.\n\nSo, my point is not to consider college and certain subjects as unimportant. You may experience it yourself later when you enter college. Although referred to as a \"Major\" in my view, it is not at all focused or specific but rather broader and more extensive. There, many subjects are optional (each subject can lead to various professions) but you are expected to get good grades overall. This may be an obstacle if you have already found a certain passion or goal. Is it possible to master all professions?\n\nEverything has value and relevance if it fits the needs and goals of each individual. This note helps you plan appropriate preparations for your early achievements, so there will be no wasted time and energy. Yes, I fully understand that in science, nothing is wasted if we study it sincerely.\n\nIn the end, both grades (GPA) and college, all have their importance. If you can, there's nothing wrong with going to college and still paying attention to grades, but if you agree with my opinion, try to get adequate grades in subjects that are irrelevant to your career goals (avoid repeating). Focus more on skill development and achieving your future career goals, and strive to achieve high grades in subjects relevant to your profession.\n\nIn the worst case, if you experience something similar to me and even graduate late, don't be sad. When you finally graduate, your work experience and flight hours are sufficient to find a good job. Especially if you have been able to earn a steady income during your college years from the results of computer science itself, what do you need to worry about? Academic grades? Haha.\n\nDon't just aim for grades to pass, but aim for grades that you can justify. Don't let after graduation you work in a field that doesn't match what you've learned during your college years; it's a waste of money, time, and energy."
        },
        {
          "title": "Blooming Red Roses: Introduction",
          "url": "/write/introduction",
          "date": "Aug 2022",
          "full_date": "August 7, 2023",
          "warning": null,
          "read_more": null,
          "close": null,
          "content": "JavaScript Developer",
          "resolution": null,
          "resolution_content": null
        }
      ],
      "maintenance": {
        "p1": "If you see this page, cloudfront is functioning properly, and something is being set up.\nFurther waiting is required.\n\nFor information and business inquiries, please refer to",
        "p2": "\n\nHave a great day!"
      }
    }
  }
}
