{
  "fr": {
    "translation": {
      "pages": {
        "write": "Écrire",
        "home": "RedVelvet"
      },
      "paper_list": [
        {
          "title": "Plongée dans le terrier du lapin : Perspective de l'informatique",
          "url": "/write/perspective-of-computer-science",
          "date": "Sep 2023",
          "full_date": "12 septembre 2023",
          "warning": "Avertissement : Cet avis contient des opinions, des expériences personnelles et des points de vue extrêmes sur l'informatique dans le contexte de l'enseignement supérieur. Il ne vise pas à rabaisser ou offenser qui que ce soit, veuillez ne pas le prendre pour argent comptant sans réflexion approfondie. En cliquant sur 'En savoir plus' vous êtes réputé avoir compris cela.",
          "read_more": "En savoir plus",
          "close": "Fermer",
          "content": "Avez-vous déjà eu le sentiment que de bonnes notes ou un GPA élevé ne sont pas tout dans le monde de l'éducation ? Cet avis contient mes opinions, qui peuvent être très différentes, et vous pourriez même être en désaccord. Je ne vous demande pas de partager ou d'accepter mes opinions ; mon principe est de privilégier la compréhension et le développement personnel plutôt que de simplement rechercher de bonnes notes ou un GPA élevé. Mon parcours éducatif est une diplomation en sciences de la nature du lycée.\n\nCommençons par quelque chose d'intéressant. À la fin du semestre, mon professeur a déclaré catégoriquement : \"Vous n'avez pas besoin d'être étudiant en informatique pour être un programmeur ou un développeur de logiciels.\" Je suis entièrement d'accord avec son point de vue, alors que la plupart des autres étudiants étaient choqués de l'entendre. Comment vous sentiriez-vous si, au milieu de votre confusion et de votre épuisement en cours d'études, vous entendiez une telle déclaration vers la fin du semestre ? Regretteriez-vous d'avoir choisi l'informatique comme matière principale ? Haha, personnellement, je ne le regrette pas. Je suis d'accord avec le professeur, car je l'avais déjà prouvé en gagnant environ soixante millions d'IDR, soit environ 3 900 USD, grâce à un seul projet logiciel utilisant le langage de programmation JavaScript (le projet est toujours en cours et est productif jusqu'à aujourd'hui). Pour votre information, mon université n'enseigne pas du tout JavaScript.\n\nPeut-être comprenez-vous maintenant pourquoi je ne donne pas une grande priorité aux notes. Pour moi, les notes ne sont que des gribouillages sur du papier et une simple reconnaissance qui entrave mes objectifs. Je ne crois pas que de bonnes notes signifient nécessairement de grandes compétences. Je pense que les notes doivent être prouvées par des actions réelles et des responsabilités assumées.\n\nVous pourriez vous demander comment je peux être productif en informatique lorsque ma réputation académique n'est pas brillante. Avant de répondre à cela, réfléchissez à vos objectifs en entrant à l'université. Êtes-vous vraiment allé à l'université uniquement pour l'argent et à cause de l'argent ? Pensez-vous qu'un diplôme est le seul moyen d'obtenir un bon emploi ? Ma réponse est de négliger d'abord les notes et de se concentrer sur les aspects financiers. Cela ne signifie pas que je n'ai pas besoin de notes ; je les mets simplement de côté.\n\nJe n'ai pas pris cette décision à la légère. J'ai des raisons concrètes de ne pas faire confiance aux notes. Vous pourriez me traiter de fou ou de stupide, et je n'argumenterai pas contre, compte tenu de mon GPA inférieur à la moyenne. J'ai des inquiétudes car de nombreuses personnes ont de bonnes notes mais luttent dans le monde réel. Même si ce n'est pas vraiment mon problème, je m'inquiète car de bonnes notes ne signifient pas toujours de bonnes compétences pratiques.\n\nVoulez-vous entendre quelque chose de surprenant ? Mon professeur a dit : \"90 % des étudiants qui assistent aux séminaires sont tous désorganisés\" et ils réussissent quand même. J'ai également reçu plusieurs offres pour aider des camarades de classe ayant de meilleures notes que moi à terminer leurs mémoires de fin d'études ; je n'ai accepté que quelques-unes de ces offres parce qu'elles proposaient de l'argent, pas seulement des notes ou une simple reconnaissance.\n\nDans ce cas, dans quelle perspective devrais-je avoir confiance en les notes ?",
          "resolution": "Résolution : Choses à prendre en compte si vous souhaitez vous plonger dans l'informatique en autodidacte ou au niveau universitaire.",
          "resolution_content": "Ne vous inquiétez pas, même si vous n'êtes pas diplômé d'une école technique ou d'une filière scientifique (sciences). Je crois que vous pouvez devenir un professionnel de l'informatique en utilisant simplement Internet (auto-apprentissage ou sans suivre de cours). J'étais complètement ignorant lorsque j'ai plongé pour la première fois dans le monde de l'informatique, et l'une de mes craintes était les mathématiques, même JavaScript n'a pas fait exception.\n\nNe croyez pas que l'université soit le seul moyen d'obtenir un emploi. Dehors, il y a de nombreuses personnes sans diplômes académiques qui peuvent offrir une bonne éducation à leurs enfants. À votre avis, comment financent-elles l'éducation de leurs enfants ? Les feuilles ? Allez à l'université pour vous améliorer et vous forger une réputation. Avec un diplôme, votre position professionnelle peut s'élever, et vous pouvez obtenir un salaire plus élevé. Cependant, rappelez-vous que vous devez également être responsable de votre nom et de votre diplôme.\n\nVous pouvez vraiment devenir un expert en adoptant une approche d'apprentissage autonome (auto-apprentissage). Si vous choisissez cette voie, l'université sera une exigence (supplémentaire), tandis que l'université peut être plus axée sur les besoins (principaux). Outre les compétences, avoir un réseau ou des connexions étendues est également très important si vous empruntez la voie de l'auto-apprentissage. En fait, à la fin, lorsque vous serez à l'université, on vous demandera toujours de développer considérablement vos compétences en apprentissage autonome, mais avec l'orientation et les conseils des enseignants.\n\nAprès avoir franchi les portes de l'université, vous suivrez un programme d'études établi. Vous serez confronté à diverses matières, dont certaines peuvent être considérées comme facultatives selon mon point de vue. Les matières auxquelles vous serez confronté couvrent divers domaines, de l'algorithmique à la programmation, du calcul aux sciences de l'intelligence artificielle, de la conception aux tests de logiciels.\n\nPourquoi facultatif ? À mon avis, il est peut-être exagéré de s'efforcer de maîtriser toutes les matières, mais ce n'est pas grave si vous le pouvez. Mon conseil est de ne pas chercher à obtenir les meilleures notes dans toutes les matières, qui seront finalement oubliées (car elles ne sont pas utilisées dans le monde du travail), mais de vous concentrer davantage sur la réalisation de vos objectifs. Cherchez des notes suffisantes pour les matières non pertinentes et maximisez l'apprentissage dans les matières pertinentes pour votre future carrière.\n\nNotez que chaque enseignant a également sa propre expertise. Je suis sûr que lorsque vous irez à l'université, vous ne verrez pas directement un enseignant de mathématiques implémenter ses connaissances mathématiques dans l'informatique (programmation) et expliquer sa pertinence. De plus, il est rare que les enseignants de programmation intègrent directement les connaissances mathématiques de l'enseignant précédent dans le programme qu'ils vous enseignent. Tout cela relève de votre responsabilité en matière de développement personnel, et tout dépend de la réalisation de vos objectifs. Votre future profession nécessitera-t-elle une compréhension approfondie des mathématiques ? Si ce n'est pas le cas, vous n'avez pas besoin de vous acharner à maximiser votre compréhension des mathématiques.\n\nPourquoi devriez-vous vous acharner à maîtriser toutes les matières ? Voulez-vous devenir un avatar ? Je considère cela comme une perte de temps. Rappelez-vous, un boxeur n'est pas obligé de voler comme un pilote, et vice versa.\n\nAlors, mon point de vue n'est pas de considérer l'université et certaines matières comme sans importance. Vous pourriez le vivre vous-même plus tard lorsque vous irez à l'université. Bien que cela soit appelé une \"majeure\" à mon avis, ce n'est en aucun cas focalisé ou spécifique, mais plutôt large et étendu. Il y a de nombreuses matières facultatives (chaque matière peut mener à diverses professions), mais on s'attend à ce que vous obteniez de bonnes notes dans l'ensemble. Cela peut être un obstacle si vous avez déjà trouvé une passion ou un objectif particulier. Est-il possible de maîtriser toutes les professions ?\n\nTout a de la valeur et de la pertinence s'il répond aux besoins et aux objectifs de chacun. Cette note vous aidera à planifier des préparatifs appropriés pour vos succès précoces, afin de ne pas gaspiller de temps et d'énergie. Oui, je comprends parfaitement qu'en sciences, rien n'est gaspillé si nous l'étudions sincèrement.\n\nEn fin de compte, à la fois les notes (GPA) et l'université ont leur importance. Si vous le pouvez, il n'y a rien de mal à aller à l'université tout en étant attentif aux notes, mais si vous êtes d'accord avec mon point de vue, essayez d'obtenir des notes adéquates dans les matières qui ne sont pas pertinentes pour vos objectifs professionnels (évitez les redoublements). Concentrez-vous davantage sur le développement des compétences et la réalisation de vos objectifs professionnels futurs, et visez des notes élevées dans les matières pertinentes à votre profession.\n\nDans le pire des cas, si vous vivez quelque chose de similaire à ce que j'ai vécu et que vous obtenez même votre diplôme tardivement, ne soyez pas triste. Lorsque vous obtiendrez finalement votre diplôme, votre expérience professionnelle et vos heures de vol seront suffisantes pour trouver un bon emploi. Surtout si vous avez déjà pu gagner un revenu stable grâce à l'informatique pendant vos années d'université, pourquoi vous inquiéter des notes académiques ? Haha.\n\nNe visez pas seulement des notes pour réussir, visez des notes que vous pouvez justifier. Ne laissez pas, après avoir obtenu votre diplôme, vous travailler dans un domaine qui ne correspond pas à ce que vous avez appris pendant vos années d'université ; c'est une perte d'argent, de temps et d'énergie."
        },
        {
          "title": "Épanouissement des roses rouges : Introduction",
          "url": "/write/introduction",
          "date": "Août 2022",
          "full_date": "7 août 2023",
          "warning": null,
          "read_more": null,
          "close": null,
          "content": "Développeur JavaScript",
          "resolution": null,
          "resolution_content": null
        }
      ],
      "maintenance": {
        "p1": "Si vous voyez cette page, Cloudfront fonctionne correctement et quelque chose est en cours de configuration. Une attente supplémentaire est nécessaire.\n\nPour des informations et des demandes commerciales, veuillez vous référer à",
        "p2": "\n\nPassez une excellente journée !"
      }
    }
  }
}
