{
  "jp": {
    "translation": {
      "pages": {
        "write": "書く",
        "home": "RedVelvet"
      },
      "paper_list": [
        {
          "title": "ウサギの穴に飛び込む: コンピューター サイエンスの視点",
          "url": "/write/perspective-of-computer-science",
          "date": "2023年9月",
          "full_date": "2023年9月12日",
          "warning": "警告: これらのメモには、講義におけるコンピューター サイエンスに関する意見、個人的な経験、極端な視点が含まれています。 当事者を貶めたり気分を害したりすることを目的としたものではありません。 何も考えずに完全に消化しないでください。 「続きを読む」を押すと理解したものとみなされます。",
          "read_more": "続きを読む",
          "close": "閉じる",
          "content": "教育の世界では成績やGPAがすべてではないと感じたことはありますか? このメモには私の見解が含まれていますが、これは大きく異なる可能性があり、おそらくあなたでも異論があるかもしれません。 私はあなたに私の意見や見解に同意するよう強制するために何かを求めているわけではありません。 私の原則は、単に高い成績や GPA を追い求めるのではなく、自己理解と成長を優先することです。 私の学歴は高校卒業で自然科学 (科学) を専攻しています。\n\n何か興味深いことから始めましょう。 学期の終わりに、私の教授は「プログラマーやソフトウェア開発者になるために情報学の学生である必要はない」と力説しました。 私は彼の意見に完全に同意しましたが、他のほとんどの学生はそれを聞いてショックを受けました。 大学の混乱と疲弊のさなか、学期末にそのような言葉を聞いたらどう思いますか? 情報学専攻を選択したことを後悔しますか? ははは、個人的には申し訳ないと思っています。 私が講師に同意するのは、彼の議論を聞いたとき、JavaScript プログラミング言語のみを使用するたった 1 つのソフトウェア プロジェクトで約 6,000 万 IDR、または約 3,900 ドルを稼いでそれを証明したからです (プロジェクトは現在も実行され、生産されています) ）。 追加情報として、私のキャンパスでは JavaScript をまったく教えていません。\n\n私が GPA をあまり優先していない理由が理解できたかもしれません。 私にとって、成績は単なる紙の走り書きであり、目標の邪魔をする単なる認識です。 成績が良い＝技術が高いとは思いません。 私は、価値は実際の行動と果たされる責任によって証明されるべきだと信じています。\n\n学術的な評判があまりよくない私が、コンピュータ サイエンスを通じてどのように生産性を高めることができるのか疑問に思っているのではないでしょうか? 答える前に、大学入学時の目標を考えてみましょう。 お金のため、お金のためだけに大学に行くというのは本当ですか？ 学位を取得することが良い仕事への唯一の道だと思いますか? 私の答えは、価値を無視して、まず財務面に焦点を当てることを選択することです。 だからといって、成績が必要ないというわけではありません。 私はそれを脇に置きました。\n\nこの決定を不用意に行ったわけではありません。 私が成績を信じないのには特別な理由があります。 私のことを頭がおかしいとかバカだと言う人もいるかもしれませんが、私の GPA が平均以下であることを考えると、私は反論しません。 成績は良くても現実の世界で苦労している人がたくさんいるので心配です。 これは実際には私には関係のないことですが、成績が良いからといって必ずしも実践的なスキルがあるとは限らないため、心配しています。\n\nまた驚くべきことを聞きたいですか? 先生は「セミナーを受ける学生の9割はめちゃくちゃだ」と言っていたのに、それでも合格してしまうのです。 また、私よりも成績の良いクラスメートの論文完成を手伝いたいという申し出もいくつか受けました。 価値や単なる評価ではなく、金銭を提供するという理由で受け入れるオファーは一部だけです。\n\nそうであれば、どの観点から価値を信じるべきですか?",
          "resolution": "解決策: 学部レベルでコンピュータ サイエンスまたは情報学に入学したい場合に注意すべきこと。",
          "resolution_content": "専門学校や自然科学（理系）を卒業していなくても、ご安心ください。 インターネットを使うだけで（講義を受けずに独学で）、きっとコンピュータサイエンスの分野のプロフェッショナルになれると思います。 私もコンピューター サイエンスの世界に初めて入ったときは全盲でした。私の恐怖の 1 つは数学でした。JavaScript ですら例外ではありません。\n\n大学に進学することが仕事を得る唯一の方法であると考えないでください。 世の中には、学位を持っていなくても、子供たちに良い教育を提供できる人がたくさんいます。 彼らは子供の教育資金を何に使っていると思いますか? 葉？ 自分自身を向上させ、評判を築くために勉強してください。 学位を取得すると、役職が上がり、より高い給与を得ることができます。 ただし、自分が取得する名前と肩書にも責任を負わなければならないことに注意してください。\n\n独立した (独学) 学習アプローチを使えば、真の専門家になることができます。 この道を選択した場合、大学は必須（追加）になりますが、別のルートを選択した場合、大学は必要（メイン）に重点が置かれる可能性があります。 独学で学ぶ場合は、専門知識のほかに、幅広いネットワークやコネクションを持つことも非常に重要です。 実際、大学在学中にも、講師の指導や指導を受けながら、自主的に学習する能力を大幅に伸ばすことが求められます。\n\n大学入学後は、所定のカリキュラムに従うことになります。 さまざまな科目に遭遇することになりますが、私の考えでは、あなたの希望に応じて、そのうちのいくつかはオプションであると考えられます。 直面する科目は、プログラミング アルゴリズム、ソフトウェア エンジニアリング、微積分学、人工知能、デザイン、ソフトウェア テストに至るまで、さまざまな分野をカバーしています。\n\nなぜオプションなのですか? 私の考えでは、すべての科目をマスターしようとするのはやりすぎかもしれませんが、できて損はありません。 私のアドバイスは、（仕事の世界では使われないため）忘れ去られてしまうすべての科目で最高のスコアを達成しようと懸命に努力するよりも、目標を達成することに集中した方がよいということです。 無関係な科目について十分な成績を求め、将来のキャリア目標に関連するレッスンを最大限に活用しましょう。\n\n各講師にも独自の専門分野があることに注意してください。 大学に行くと、数学の講師が数学とコンピュータサイエンスの関係（プログラム）を直接実装し、説明している姿を見ることはないと思います。 それとは別に、プログラミングを教える講師が、以前の講師から得た数学的知識を自分が教えるプログラムに直接適用することはまれです。 これらすべては自己啓発におけるあなたの責任であり、目標を達成することに遡ります。 将来の仕事では複雑な数学の理解が必要になりますか? そうでない場合は、数学を最大限に理解するために無理をする必要はありません。\n\nすべての科目を習得するために一生懸命努力する必要があるのはなぜですか? アバターになりたいですか？ これは時間の無駄だと思います。 覚えておいてください、ボクサーはパイロットのように飛行できる必要はありませんし、その逆も同様です。\n\nつまり、私が言いたいのは、大学や特定の科目が重要ではないと考えているわけではありません。 もしかしたら、大学に入ってから自分でも実感するかもしれません。 「メジャー」といっても、焦点が絞られていたり具体的だったりするのではなく、むしろ広くて広がりのあるものだと思います。 そこでは、多くの科目が選択可能ですが（科目ごとに異なる職業に就くことができます）、全体的に良い成績を取ることが期待されます。 特定の情熱や目標を見つけた場合、これは障害になる可能性があります。 すべての職業をマスターすることは可能ですか?\n\n個人のニーズと目標に合ったものであれば、すべてに価値と関連性があります。 これらのメモは、時間とエネルギーを無駄にしないように、自分の成果に適した準備を事前に計画するのに役立ちます。 はい、科学は真面目に勉強すれば無駄なことはないということはよくわかりました。\n\n結局のところ、成績 (GPA) であろうと大学であろうと、それぞれに独自の重要性があります。 可能であれば、大学に行って成績を気にすることに害はありませんが、私の意見に同意する場合は、目標に関係のない科目で適切な成績を取得するように努めてください（繰り返しは避けてください）。 スキルの向上と将来のキャリア目標の達成にもっと重点を置き、自分の職業に関連する科目で高い成績を収めるように努めてください\n\n最悪の場合、私と同じような経験をして卒業が遅れても、やめてください。悲しくないよ。 最終的に卒業するとき、あなたの職歴と飛行時間は、良い仕事を見つけるのに十分でしょう。 特に、コンピューター サイエンス自体の勉強中に安定した収入を得ることができた場合、何を心配する必要がありますか? 学業成績？ 笑。\n\n卒業を目的とした成績だけを探すのではなく、自分が責任を持てる成績を探してください。 卒業後は、在学中に学んだことと一致しない分野で働かないでください。 それはお金、時間、エネルギーの無駄です。"
        },
        {
          "title": "咲く赤いバラ: はじめに",
          "url": "/write/introduction",
          "date": "2022年8月",
          "full_date": "2023年8月7日",
          "warning": null,
          "read_more": null,
          "close": null,
          "content": "JavaScript 開発者",
          "resolution": null,
          "resolution_content": null
        }
      ],
      "maintenance": {
        "p1": "このページが表示されている場合は、cloudfront が正常に機能しており、何かがセットアップされています。\nさらに待つ必要があります。\n\n情報およびビジネスに関するお問い合わせについては、以下を参照してください。",
        "p2": "\n\nすてきな一日を！"
      }
    }
  }
}
