{
  "ru": {
    "translation": {
      "pages": {
        "write": "Писать",
        "home": "RedVelvet"
      },
      "paper_list": [
        {
          "title": "Погружение в кроличью нору: Взгляд на компьютерные науки",
          "url": "/write/perspective-of-computer-science",
          "date": "Сентябрь 2023",
          "full_date": "12 сентября 2023 года",
          "warning": "Предупреждение: Эта запись содержит мнение, личный опыт и крайнюю точку зрения на компьютерные науки в контексте обучения. Она не призвана уничижать или оскорблять какую-либо сторону, пожалуйста, не воспринимайте ее как голословное утверждение без дополнительного обдумывания. Нажатие кнопки «Читать дальше» означает, что вы соглашаетесь с этим.",
          "read_more": "Читать далее",
          "close": "Закрыть",
          "content": "Вы когда-нибудь чувствовали, что высокие оценки или GPA - это не все в мире образования? В этой записи содержится моя точка зрения, которая может сильно отличаться, возможно, даже вызвать возражения. Я не прошу и не пытаюсь заставить вас согласиться с моим мнением. Моя философия заключается в приоритете понимания и саморазвития, а не в стремлении только к высоким оценкам или GPA. Мое образование началось в средней школе в области естественных наук (научных исследований).\n\nДавайте начнем с чего-то интересного. В конце семестра мой преподаватель очень четко заявил: «Вам не обязательно быть студентом информатики, чтобы стать программистом или разработчиком программного обеспечения». Я полностью согласен с этим утверждением, в то время как многие другие студенты были удивлены. Каковы ваши чувства, если, будучи запутанными и усталыми во время учебы, вы слышите такое заявление ближе к концу семестра? Пожалуй, вы бы сожалели, что выбрали информатику в качестве своей специализации? На самом деле, лично я не сожалею об этом. Я поддерживаю этого преподавателя, потому что, когда я услышал его аргументы, я подтвердил их, заработав около шестьдесят миллионов IDR или примерно 3900 долларов от одного программного проекта, использующего только язык программирования JavaScript (проект все еще продуктивен и активен по сей день). Дополнительной информацией является то, что мой университет совершенно не преподает язык программирования JavaScript.\n\nТеперь, возможно, вы понимаете, почему я не слишком ценю GPA. Для меня оценки - это просто метки на бумаге и признание, которое мешает моим целям. Я не верю, что высокие оценки означают большие навыки. Я считаю, что оценки должны подтверждаться реальными действиями и ответственностью.\n\nВозможно, вы задаетесь вопросом, как я могу быть продуктивным в области компьютерных наук с плохой академической репутацией? Прежде чем я на это ответю, подумайте о своих целях при поступлении в университет. Поступили ли вы в университет только ради денег и из-за денег? Вы считаете, что диплом - это единственный способ получить хорошую работу? Мой ответ заключается в том, что я сначала выбрал игнорировать оценки и сосредотачиться на финансовых аспектах. Это не значит, что мне не нужны оценки, я просто отодвинул их на второй план.\n\nЯ не принимал это решение наугад. У меня есть свои особые причины не доверять оценкам. Возможно, вы назовете меня сумасшедшим или глупым, и я не буду спорить, учитывая, что мой GPA ниже среднего. Я беспокоюсь, потому что многие люди с высокими оценками испытывают трудности в реальной жизни. Хотя, по сути, это не мое дело, но я беспокоюсь, потому что высокие оценки не всегда означают наличие практических навыков.\n\nХотите услышать еще одну неожиданную вещь? Мой преподаватель сказал, что «90% студентов, участвующих в семинарах, все беспорядок», и все равно они сдают. Я также получил несколько предложений помочь своим товарищам по курсу, у которых были более высокие оценки, чем у меня, в написании их дипломных работ. Я принял несколько из этих предложений, потому что они предлагали деньги, а не просто оценки или признание.\n\nВ таком случае, с какой стороны мне доверять оценкам?",
          "resolution": "Решение: что следует учитывать, если вы хотите самостоятельно изучать компьютерные науки или информатику на бакалаврском уровне.",
          "resolution_content": "Не волнуйтесь, даже если вы не окончили среднюю школу в области науки или не имеете этому образованию. Я уверен, что вы можете стать профессионалом в области компьютерных наук, используя интернет (самостоятельное обучение или обучение без посещения лекций). Я также был полностью не знаком с миром компьютерных наук, когда впервые в него погрузился, и одним из моих страхов была математика, и даже язык программирования JavaScript не исключение.\n\nНе считайте, что учеба - это единственный способ получения работы. Среди людей, не имеющих академической степени, много тех, кто может давать хорошее образование своим детям. Вы думаете, что они платят за образование своих детей чем-то другим, кроме денег? Лучше всего учиться для самосовершенствования и построения своей репутации. С дипломом вы можете поднять свой карьерный статус и получить более высокую зарплату. Однако помните, что вы также несете ответственность за свое имя и степень, которую вы получили.\n\nВы действительно можете стать экспертом с подходом самостоятельного обучения. Если вы выбираете этот путь, учеба будет необходимостью (дополнительной), в то время как, если вы выбираете другой путь, учеба может быть более ориентированной на потребности (основной). Помимо навыков, имея широкие связи или контакты также очень важно, если вы идете по пути самообучения. На самом деле, в конечном итоге, когда вы находитесь в университете, вам все равно потребуется развивать навыки самостоятельного обучения в значительной степени, но при наставничестве и руководстве преподавателей.\n\nПосле поступления в университет вы будете следовать предписанной учебной программе. Вам придется столкнуться с различными предметами, некоторые из которых могут считаться необязательными согласно моему мнению, в зависимости от ваших амбиций. Ваши предметы будут включать в себя широкий спектр областей, включая программирование алгоритмов, разработку программного обеспечения, калькулюс, искусственный интеллект, дизайн и тестирование программного обеспечения.\n\nПочему они необязательны? По моему мнению, попытка овладеть всеми предметами может быть чрезмерной, но это не мешает, если у вас есть возможность это сделать. Мой совет - вместо беспокойства о достижении высших баллов во всех предметах, которые в конечном итоге будут забыты, лучше сосредоточьтесь на достижении своих амбиций. Ищите баллы, достаточные для предметов, не связанных с вашими целями, и максимизируйте знания в тех предметах, которые имеют отношение к вашей будущей карьере.\n\nИмейте в виду, что каждый преподаватель также имеет свою область экспертизы. Я уверен, что когда вы будете на учебе, вы не увидите, как преподаватели по математике непосредственно применяют и объясняют связь своей математики с компьютерными науками (программированием). К тому же, редко бывает, чтобы преподаватели по программированию внедряли знания математики, полученные от предыдущих преподавателей, непосредственно в учебный процесс. Все это является вашей обязанностью в процессе саморазвития и, снова же, зависит от ваших амбиций. Понадобятся ли вам сложные математические знания в вашей будущей работе? Если нет, вам не обязательно углубляться в изучение математики.\n\nПочему вам стоит стараться овладеть всеми предметами? Хотите быть везде и нигде? Я считаю это пустой тратой времени. Помните, боксеру не нужно уметь летать, как пилот, и наоборот.\n\nИтак, моя цель не заключается в том, чтобы считать учебу и некоторые предметы неважными. Возможно, вы поймете это сами, когда поступите на учебу. Несмотря на то что это называется «специальностью», по моему мнению, она не фокусируется или не ограничивается одной областью, а расширяется и охватывает множество областей. Там существует много необязательных предметов (каждый предмет может вести к различным профессиям), но от вас ожидается получение хороших оценок в целом. Это может быть проблемой, если вы уже определили свою страсть или цель. Возможно ли овладеть всеми профессиями?\n\nВсе имеет свою ценность и релевантность, если оно соответствует вашим потребностям и целям. Эта запись поможет вам спланировать свою подготовку более заранее, чтобы избежать бесполезных затрат времени и энергии. Да, я полностью понимаю, что в науке ничто не бывает напрасным, если мы учимся искренне.\n\nВ конечном итоге как оценки (GPA), так и образование имеют свое значение. Если у вас есть возможность, нет ничего плохого в том, чтобы учиться и продолжать следить за оценками, но если вы согласны с моим мнением, постарайтесь получить достаточные оценки в предметах, не имеющих отношения к вашим карьерным целям (избегайте повторения). Сосредотачивайтесь больше на развитии навыков и достижении целей вашей будущей карьеры, а также старайтесь получать высокие баллы в предметах, связанных с вашей профессией.\n\nВ самом худшем случае, если у вас случится что-то подобное моему и даже с задержкой получится диплом, не расстраивайтесь. Когда вы наконец получите свой диплом, ваш опыт и количество часов ваших занятий будет достаточным для того, чтобы найти хорошую работу. Особенно если вам удастся зарабатывать стабильный доход во время учебы благодаря компьютерным наукам, на что вам нужно беспокоиться? Учебные оценки? Ха-ха.\n\nНе просто получайте оценки, чтобы сдать экзамены, но получайте оценки, за которые вы можете отвечать. Не дайте себе устроиться на работу, не связанную с тем, что вы учили в университете, это будет трата денег, времени и энергии."
        },
        {
          "title": "Расцветшие красные розы: Введение",
          "url": "/write/introduction",
          "date": "Авг 2022",
          "full_date": "7 августа 2023 г.",
          "warning": null,
          "read_more": null,
          "close": null,
          "content": "JavaScript разработчик",
          "resolution": null,
          "resolution_content": null
        }
      ],
      "maintenance": {
        "p1": "Если вы просматриваете эту страницу, значит Cloudfront работает нормально и что-то настраивается. Требуется дальнейшее ожидание.\n\nДля получения информации и деловых вопросов см.",
        "p2": "\n\nХорошего дня!"
      }
    }
  }
}
