{
  "ru": {
    "translation": {
      "pages": {
        "write": "Писать",
        "home": "RedVelvet"
      },
      "paper_list": [
        {
          "title": "Ныряние в кроличью нору: взгляд на информатику",
          "url": "/write/perspective-of-computer-science",
          "date": "Сентябрь 2023",
          "full_date": "12 сентября 2023 года",
          "warning": "Предупреждение: эти заметки содержат мнения, личный опыт и крайние точки зрения на информатику в контексте лекций. Не предназначено для унижения или оскорбления какой-либо стороны; пожалуйста, не переваривайте это полностью без дальнейшего рассмотрения. Нажимая «Читать далее», вы считаете, что поняли.",
          "read_more": "Читать далее",
          "close": "Закрыть",
          "content": "Вы когда-нибудь чувствовали, что высокие оценки или средний балл – это еще не все в мире образования? В этой заметке собраны мои взгляды, которые могут быть очень разными, возможно, даже вы их оспорите. Я не прошу ничего другого, что могло бы заставить вас согласиться с моим мнением или взглядами; Мой принцип — отдавать приоритет самопониманию и развитию, а не просто гоняться за высокими оценками или средним баллом. По образованию я закончил среднюю школу по специальности «естественные науки».\n\nНачнем с чего-то интересного. В конце семестра мой профессор решительно заявил: «Вам не обязательно быть студентом информатики, чтобы стать программистом или разработчиком программного обеспечения». Я полностью согласился с его точкой зрения, в то время как большинство других студентов были потрясены, услышав это. Как бы вы себя почувствовали, если бы среди смятения и усталости в колледже услышали подобное заявление ближе к концу семестра? Не пожалеете ли вы, что выбрали специальность «Информатика»? Хаха, мне лично не жаль. Я согласен с лектором только потому, что, когда я услышал его аргументы, я доказал это, заработав около шестидесяти миллионов индонезийских рупий или около 3900 долларов всего за один проект программного обеспечения, который использует только язык программирования JavaScript (проект все еще работает и продуктивен по сей день). ). Для получения дополнительной информации: в моем кампусе вообще не преподают JavaScript.\n\nТеперь, возможно, вы понимаете, почему я не уделяю особого внимания среднему баллу. Для меня оценки — это просто каракули на бумаге и признание, мешающее достижению моих целей. Я не верю, что высокие оценки означают наличие хороших навыков. Я считаю, что ценность должна быть доказана реальными действиями и обязанностями.\n\nВозможно, вы задаетесь вопросом, как я могу продуктивно заниматься информатикой с не очень хорошей академической репутацией? Прежде чем я отвечу, подумайте о своих целях при поступлении в университет. Правда ли, что в университет поступают только ради денег и ради денег? Вы думаете, что высшее образование – единственный путь к хорошей работе? Мой ответ — игнорировать ценность и в первую очередь сосредоточиться на финансовом аспекте. Это не значит, что мне не нужны оценки; Я просто отложил это в сторону.\n\nЯ принял это решение не по неосторожности. У меня есть конкретная причина, по которой я не верю в оценки. Вы можете назвать меня сумасшедшим или глупым, и я не буду спорить, учитывая, что мой средний балл ниже среднего. Я волнуюсь, потому что многие из них имеют высокие оценки, но испытывают трудности в реальном мире. Хотя на самом деле это не мое дело, я волнуюсь, потому что высокие оценки не всегда означают наличие практических навыков.\n\nХотите снова услышать что-то удивительное? Мой профессор сказал, что «90% студентов, которые посещают семинары, все запутались», и тем не менее они все равно сдают экзамен. Я также получил несколько предложений помочь моим одноклассникам, у которых были более высокие оценки, чем у меня, в написании диссертаций; только некоторые предложения я принимаю, потому что они предлагают деньги, а не ценность или просто признание.\n\nЕсли да, то с какой точки зрения я должен верить в ценность?",
          "resolution": "Решение: на что следует обратить внимание, если вы хотите поступить на факультет компьютерных наук или информатики на бакалавриат.",
          "resolution_content": "Не волнуйтесь, даже если вы не окончили ПТУ или специальность «естественные науки» (наука). Я уверен, что стать профессионалом в области информатики можно, просто воспользовавшись Интернетом (обучаясь самостоятельно или не посещая лекции). Я также был совершенно слеп, когда впервые попал в мир информатики, и одним из моих страхов была математика, даже JavaScript не является исключением.\n\nНе думайте, что колледж — единственный способ получить работу. Там много людей, не имеющих ученых степеней, но способных дать хорошее образование своим детям. Как вы думаете, что они используют для финансирования образования своих детей? лист? Учитесь, чтобы улучшить себя и построить репутацию. С получением ученой степени ваша должность может повыситься, и вы сможете получать более высокую зарплату. Однако помните, что вы также должны нести ответственность за полученное вами имя и звание.\n\nВы можете стать настоящим экспертом, применяя независимый (самообучающийся) подход к обучению. Если вы выберете этот путь, колледж станет необходимостью (дополнительным), а если вы выберете другой путь, колледж может стать более ориентированным на необходимость (основной). Помимо опыта, наличие широкой сети или связей также очень важно, если вы выберете путь самообучения. Фактически, в конечном итоге, когда вы учитесь в университете, вам все равно придется значительно развивать свои способности к самостоятельному обучению, но под руководством и руководством преподавателей.\n\nПосле поступления в университет вы будете следовать заранее определенной учебной программе. Вы столкнетесь с множеством предметов, некоторые из которых, на мой взгляд, могут считаться необязательными, в зависимости от ваших стремлений. Предметы, с которыми вы столкнетесь, охватывают различные области: от алгоритмов программирования, разработки программного обеспечения, исчисления, искусственного интеллекта, дизайна до тестирования программного обеспечения.\n\nПочему это необязательно? На мой взгляд, пытаться освоить все предметы может быть слишком сложно, но в том, чтобы это сделать, нет никакого вреда. Мой совет: вместо того, чтобы изо всех сил пытаться набрать наивысший балл по всем предметам, которые в конечном итоге забываются (поскольку они не используются в сфере труда), вам лучше сосредоточиться на достижении своих целей. Ищите достаточные оценки по нерелевантным предметам и максимально увеличивайте количество уроков, которые соответствуют вашим будущим карьерным целям.\n\nОбратите внимание, что у каждого преподавателя также есть своя область знаний. Я уверен, что когда вы пойдете в колледж, вы не увидите преподавателей математики, непосредственно реализующих и объясняющих взаимосвязь между математикой и информатикой (программами). Кроме того, преподаватели, преподающие программирование, редко применяют математические знания предыдущих преподавателей непосредственно в программе, которую они вам преподают. Все это ваша ответственность в саморазвитии и ведет к достижению ваших целей. Будет ли ваша будущая работа требовать понимания сложной математики? Если нет, то вам не нужно переусердствовать в улучшении своего понимания математики.\n\nПочему вам нужно усердно стараться освоить все предметы? Хотите быть аватаром? Я считаю это пустой тратой времени. Помните, что боксер не обязан уметь летать как пилот, и наоборот.\n\nИтак, я имею в виду, что не стоит думать, что колледж и некоторые предметы не важны. Возможно, вы сами это почувствуете позже, когда поступите в колледж. Несмотря на то, что он называется «Основной», я не думаю, что он какой-то сфокусированный или конкретный, а скорее широкий и обширный. Там многие предметы не являются обязательными (каждый предмет может вести к разным профессиям), но в целом от вас ожидают хороших оценок. Это может стать препятствием, если вы нашли определенное увлечение или цель. Можно ли овладеть всеми профессиями?\n\nВсе имеет ценность и актуальность, если соответствует индивидуальным потребностям и целям. Эти записи помогут вам заранее спланировать приготовления, соответствующие вашим достижениям, чтобы не тратить зря время и силы. Да, я прекрасно понимаю, что в науке ничего не пропадает даром, если мы изучаем ее искренне.\n\nВ конце концов, будь то оценки (GPA) или колледж, каждый имеет свое значение. Если у вас есть возможность, нет ничего плохого в том, чтобы поступить в колледж и по-прежнему обращать внимание на оценки, но если вы согласны с моим мнением, постарайтесь получить адекватные оценки по предметам, которые не соответствуют вашим целям (избегайте повторов). Сосредоточьтесь больше на развитии своих навыков и достижении своих карьерных целей в будущем и постарайтесь получить высокие оценки по предметам, которые имеют отношение к вашей профессии.\n\nВ худшем случае, если вы столкнетесь с чем-то похожим на меня и даже поздно закончите обучение, не не грустно. Когда вы наконец закончите учебу, вашего опыта работы и летных часов будет достаточно, чтобы найти хорошую работу. О чем вам стоит беспокоиться, особенно если во время учебы в информатике вы смогли получать стабильный доход? Академические оценки? Ха-ха.\n\nИщите не просто оценки с целью получить высшее образование, а ищите оценки, за которые вы можете нести ответственность. Не позволяйте себе работать в области, которая не соответствует тому, чему вы научились во время учебы после окончания учебы; это пустая трата денег, времени и энергии."
        },
        {
          "title": "Цветущие красные розы: введение",
          "url": "/write/introduction",
          "date": "Авг 2022",
          "full_date": "7 августа 2023 г.",
          "warning": null,
          "read_more": null,
          "close": null,
          "content": "JavaScript разработчик",
          "resolution": null,
          "resolution_content": null
        }
      ],
      "maintenance": {
        "p1": "Если вы видите эту страницу, значит, Cloudfront работает правильно и что-то настраивается.\nТребуется дальнейшее ожидание.\n\nДля получения информации и деловых запросов см.",
        "p2": "\n\nХорошего дня!"
      }
    }
  }
}
